package ru.kellervitali.list_main;
/*
        1. Сделать классы для односвязного списка и узла списка.
           Для эффективности сделайте поле для хранения длины списка.

        2. Надо реализовать методы:
        · получение размера списка
        · получение значение первого элемента
        · получение/изменение значения по указанному индексу. Изменение значения по индексу пусть выдает старое значение.
        · удаление элемента по индексу, пусть выдает значение элемента
        · вставка элемента в начало
        · вставка элемента по индексу
        · удаление узла по значению, пусть выдает true, если элемент был удален
        · удаление первого элемента, пусть выдает значение элемента
        · разворот списка за линейное время
        · копирование списка
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello, List!");
    }
}
